wine_pairings_backend/app/controllers/api/v1/pairings_controller.rb

INSERT INTO "pairings" ("food_name", "description", "created_at", "updated_at", "wine_id") VALUES (?, ?, ?, ?, ?)  [["food_name", "Berries"], ["description", "Dessert"], ["created_at", "2021-03-17 10:57:49.869332"], ["updated_at", "2021-03-17 10:57:49.869332"], ["wine_id", 30]]
---
    def create
        @pairing = Pairing.create(pairing_params)

SELECT "pairings".* FROM "pairings" WHERE "pairings"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
    def show
        @pairing = Pairing.find_by(id: params[:id])

DELETE FROM "pairings" WHERE "pairings"."id" = ?  [["id", 31]]
SELECT "pairings".* FROM "pairings" WHERE "pairings"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
---
    def destroy
        @pairing = Pairing.find_by(id: params[:id]).destroy