wine_pairings_backend/app/controllers/api/v1/wines_controller.rb

    def index
        wines = Wine.all
---
SELECT "wines".* FROM "wines"

    def create
        # binding.pry
        if Wine.find_by(:name => wine_params[:name])
            wine = Wine.find_by(:name => wine_params[:name])
            redirect_to "/api/v1/wines/#{wine.id}"
        else
            wine = Wine.create(wine_params)
---
SELECT "wines".* FROM "wines" WHERE "wines"."name" = ? LIMIT ?  [["name", "Denise's New Wine"], ["LIMIT", 1]]
SELECT "wines".* FROM "wines" WHERE "wines"."name" = ? LIMIT ?  [["name", "Wine 315"], ["LIMIT", 1]]
INSERT INTO "wines" ("name", "color", "grape", "created_at", "updated_at", "image_url") VALUES (?, ?, ?, ?, ?, ?)

    def show
        wine = Wine.find_by(:id => params[:id].to_i)
---
SELECT "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]